In [0]:
import numpy as np
from pandas import DataFrame

In [0]:
dframe = DataFrame(np.arange(12).reshape((3,4)), index=['NY','LA','SF'], columns=['A','B','C','D'])

In [4]:
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [5]:
str.lower('A')

'a'

In [6]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [0]:
dframe.index = dframe.index.map(str.lower) # indexの名前を小文字に変換

In [9]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [10]:
str.title('udemy is good')

'Udemy Is Good'

In [11]:
dframe.rename(index=str.title, columns=str.lower) # indexとcolumnsをコールバック関数を使用して変換する

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [12]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [13]:
dframe.rename(index={'ny': 'NEW YORK'}, columns={'A':'ALPHA'}) # renameにはdictを渡すこともできる

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [14]:
dframe # renameでは元のデータは変更されない

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [0]:
dframe.rename(index={'ny': 'NEW YORK'}, columns={'A':'ALPHA'}, inplace=True) # inplaceパラメータを指定すると上書きされる

In [16]:
dframe

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11